let a = [30,24,6,23,15,67,85,3,2,67,0];
for (var i = -1; ++i < a.length;) {
  for (var m = j = i; ++j < a.length;) {
      if (a[m] > a[j]) m = j;
  }
  console.log(a.toString())
  var t = a[m];
  a[m] = a[i];
  a[i] = t;
}
console.log(a.toString());

/*
	선택 정렬, 
	1. 주어진 리스트의 최솟값 찾는다
	2. 그 값을 맨 앞에 위치한 값과 교체
	3. 맨처음 위치를 뺀 나머지 리스트를 같은 방법으로 교체
	
		[30,24,6,23,15,67,85,3,2,67,0]
	step 1
		0 [24,6,23,15,67,85,3,2,67,30]
	step 2
		0,2 [6,23,15,67,85,3,24,67,30]
	step 3
		0,2,3 [23,15,67,85,6,24,67,30]
	step 4
		0,2,3,6 [15,67,85,23,24,67,30]
	......
*/